cf_billing/Catalogs/бестКатегорииКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бестКатегорииКонтрагентов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаселениеИПриравненные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкаЗаполнения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МаксимальнаяМощностьОт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальнаяМощностьДо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиФайлаРаздел1А</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиФайлаРаздел1Б</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НастройкаЗаполненияРазделВ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦеноваяКатегория</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бестЦеновыеКатегории</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиВПределахСоцНорматива</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиСверхСоцНорматива</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/Catalogs/бестКатегорииКонтрагентов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ПолучениеДанных

// Выставляет актуальные настройки заполнения формы46.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//  РазделВ				-	Булево.
//
Процедура АктуальныеНастройкиЗаполненияФормы46(Схема, ПараметрыОтбора, ТаблицаДляПомещения = "", РазделВ = Ложь) Экспорт
	
	Если Схема = Неопределено Тогда
		Схема = Новый СхемаЗапроса;
		Пакет = Схема.ПакетЗапросов[0];		
	Иначе
		Пакет = Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Если РазделВ Тогда
		Текст = ТекстЗапросаАктуальныеНастройкиЗаполненияФормы46РазделВ();
	Иначе
		Текст = ТекстЗапросаАктуальныеНастройкиЗаполненияФормы46();
	КонецЕсли;
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = ТаблицаДляПомещения;
	Пакет.ВыбиратьРазрешенные = ?(ПараметрыОтбора.Свойство("ВыбиратьРазрешенные") И Не ПараметрыОтбора.ВыбиратьРазрешенные, Ложь, Истина);
	ОператорВыбора = Пакет.Операторы[0];	
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		
		Отбор 				= ОператорВыбора.Отбор;
		ИмяТаблицыОтбор		= "бестКатегорииКонтрагентов";
		ДоступныеПараметры 	= "Ссылка";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(Отбор, ИмяТаблицыОтбор, ПараметрыОтбора.ПараметрыВТ, ДоступныеПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ТекстЗапроса

// Возвращает текст запроса для заполнения актуальныех настройек формы46.
// 
// Возвращаемое значение:
//   Строка.
//
Функция ТекстЗапросаАктуальныеНастройкиЗаполненияФормы46() Экспорт
	
	Текст =
	"ВЫБРАТЬ
	|	бестКатегорииКонтрагентов.Ссылка КАК КатегорияПотребителя,
	|	бестКатегорииКонтрагентовНастройкаЗаполнения.МаксимальнаяМощностьОт КАК МаксимальнаяМощностьОт,
	|	бестКатегорииКонтрагентовНастройкаЗаполнения.МаксимальнаяМощностьДо КАК МаксимальнаяМощностьДо,
	|	бестКатегорииКонтрагентовНастройкаЗаполнения.НомерСтрокиФайлаРаздел1А КАК НомерСтрокиФайлаРаздел1А,
	|	бестКатегорииКонтрагентовНастройкаЗаполнения.НомерСтрокиФайлаРаздел1Б КАК НомерСтрокиФайлаРаздел1Б
	|ИЗ
	|	Справочник.бестКатегорииКонтрагентов КАК бестКатегорииКонтрагентов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бестКатегорииКонтрагентов.НастройкаЗаполнения КАК бестКатегорииКонтрагентовНастройкаЗаполнения
	|		ПО бестКатегорииКонтрагентов.Ссылка = бестКатегорииКонтрагентовНастройкаЗаполнения.Ссылка
	|			И (бестКатегорииКонтрагентов.ПометкаУдаления = ЛОЖЬ)
	|			И (НЕ бестКатегорииКонтрагентов.НаселениеИПриравненные)";
	
	Возврат Текст;
	
КонецФункции

// Возвращает текст запроса для заполнения актуальныех настройек формы46 раздел В.
// 
// Возвращаемое значение:
//   Строка.
//
Функция ТекстЗапросаАктуальныеНастройкиЗаполненияФормы46РазделВ() Экспорт
	
	Текст =
	"ВЫБРАТЬ
	|	бестКатегорииКонтрагентов.Ссылка КАК КатегорияПотребителя,
	|	бестКатегорииКонтрагентовНастройкаЗаполненияРазделВ.ЦеноваяКатегория КАК ЦеноваяКатегория,
	|	бестКатегорииКонтрагентовНастройкаЗаполненияРазделВ.НомерСтрокиВПределахСоцНорматива КАК НомерСтрокиВПределахСоцНорматива,
	|	бестКатегорииКонтрагентовНастройкаЗаполненияРазделВ.НомерСтрокиСверхСоцНорматива КАК НомерСтрокиСверхСоцНорматива
	|ИЗ
	|	Справочник.бестКатегорииКонтрагентов КАК бестКатегорииКонтрагентов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бестКатегорииКонтрагентов.НастройкаЗаполненияРазделВ КАК бестКатегорииКонтрагентовНастройкаЗаполненияРазделВ
	|		ПО бестКатегорииКонтрагентов.Ссылка = бестКатегорииКонтрагентовНастройкаЗаполненияРазделВ.Ссылка
	|			И (бестКатегорииКонтрагентов.ПометкаУдаления = ЛОЖЬ)
	|			И (бестКатегорииКонтрагентов.НаселениеИПриравненные)";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
